Revit 2026 API

# GlobalParametersManagerAreGlobalParametersAllowed Method

---

Tests whether global parameters are allowed in the given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreGlobalParametersAllowed(
	Document document
)
```
```vb
Public Shared Function AreGlobalParametersAllowed (
	document As Document
) As Boolean
```
```cpp
public:
static bool AreGlobalParametersAllowed(
	Document^ document
)
```
```fsharp
static member AreGlobalParametersAllowed :
        document : Document -> bool
```

#### Parameters

document Document
     A revit document of interest.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

First of all, global parameters can be had in main project documents only; they are not supported in family documents. However, there may also be other circumstances due to which global parameters may be disallowed in a particular project, either temporarily or permanently.

#### Reference

GlobalParametersManager Class

Autodesk.Revit.DB Namespace